Revit 2027 API
StructuralSection.MomentOfInertiaStrongAxis Property
 Moment of Inertia about main strong axis (I).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MomentOfInertiaStrongAxis { get; set; }
Public Property MomentOfInertiaStrongAxis As Double
	Get
	Set
public:
property double MomentOfInertiaStrongAxis {
	double get ();
	void set (double value);
}
member MomentOfInertiaStrongAxis : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace